manoj153/STM32F1BOARD/Src/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program body
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2017 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "stm32f1xx_hal.h"

/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Private variables ---------------------------------------------------------*/
TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim4;

UART_HandleTypeDef huart2;

/* USER CODE BEGIN PV */
/* Private variables ---------------------------------------------------------*/

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_TIM4_Init(void);
static void MX_TIM1_Init(void);
                                    
void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);
                                

/* USER CODE BEGIN PFP */
/* Private function prototypes -----------------------------------------------*/

/* USER CODE END PFP */

/* USER CODE BEGIN 0 */
#define REFdebounce 150
void readChannel(uint8_t chWhat);
void trigger(void);
void buzz(uint32_t rounds);
void delayUS(uint32_t us);
void testRun(void);
void onallLED(void);
/* Variables Start */
uint32_t dipSW 		= 0xFFFFFFFF;
uint32_t sensors 	=	0xFFFFFFFF;
uint8_t miscl = 0xFF;
_Bool inverted;
_Bool test;
_Bool CH1Rly, CH2Rly, CH3Rly, CH4Rly, CH5Rly, CH6Rly = 0x0;
_Bool Mutepb;
_Bool Pmutepb = 1;
_Bool buzzorNO  = 1;
uint32_t Mute_1;
uint32_t Mute_0;
uint32_t Pmute_1;
uint32_t Pmute_0;

_Bool Testpb;
_Bool TestpbState;
_Bool MutepbState;
_Bool PmutepbState;
_Bool PERMENANTMUTE = 1;
_Bool rxs = 0;
uint32_t Test_1;
uint32_t Test_0;
uint16_t count1;
uint16_t countetTIM1 = 0;

uint8_t txSE[] = "SE";
//UART Receiving DATA variables
uint8_t rxdata[7];
/* Variables Ends*/
 void dipSWR(void);
 union  
{
  uint32_t bit_32;
  uint8_t bytes[4];
}splitbytes;
/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */
	
  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_USART2_UART_Init();
  MX_TIM4_Init();
  MX_TIM1_Init();

  /* USER CODE BEGIN 2 */
	//UART TRANSMIT ON DE, (HIGH) LOW for Rx
	HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_SET);
	__HAL_UART_ENABLE_IT(&huart2, UART_IT_RXNE);
	HAL_GPIO_WritePin(PWR_LED_GPIO_Port, PWR_LED_Pin, GPIO_PIN_SET);
	for(int x = 0;x <2; x++)
  {
	buzz(1);
	HAL_Delay(250);
	buzz(1);
	HAL_Delay(250);
  }
	
	
  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {	
		HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_SET);
		rxs = 0;
		uint8_t testTX = 'S';
		HAL_UART_Transmit(&huart2,&testTX,1, 70);
		HAL_GPIO_WritePin(RTS_GPIO_Port, RTS_Pin, GPIO_PIN_RESET);
		HAL_Delay(2500);
		//HAL_UART_Receive(&huart2, rxdata, 7, 780);
		CH1Rly = 0x0; CH2Rly = 0x0; CH3Rly = 0x0; CH4Rly = 0x0; CH5Rly = 0x0;  CH6Rly = 0x0;
		sensors 	=	0xFFFFFFFF;
		miscl = 0xFF;
		if((rxdata[0] == 'S' && rxdata[6] == 'E' ))
		{
		for(uint8_t z =1; z <6; z++)
		{ 
			rxdata[z] = ~(rxdata[z]);
		}
		
		sensors &= ~(rxdata[1]);
		sensors &= ~(rxdata[2] << 8);
		sensors &= ~(rxdata[3] << 16);
		sensors &= ~(rxdata[4] << 24);
		miscl 	&= ~(rxdata[5]);
		
		}
		else
		{
			sensors = ~sensors;
			miscl = ~sensors;
		}

		trigger();
	
		
		
		
		//Read AC-Fail A raw High is fail. So ~(LOW-BAD, HIGH Good)
		//miscl &= ~(	HAL_GPIO_ReadPin(AC_FAIL_GPIO_Port,AC_FAIL_Pin) << 7); //bit 8 
		//miscl &= ~(	HAL_GPIO_ReadPin(CONN_FAIL_GPIO_Port,CONN_FAIL_Pin) << 6); //bit 8 
		//miscl = (~miscl);
		//Ssplitbytes.bit_32 = sensors;
//			for(uint8_t x = 0 ;x<4; x++)
//      {
//				if(x==0)
//				{
//					HAL_UART_Transmit(&huart2, txSE, 1, 10);
//				}
//				HAL_UART_Transmit(&huart2, &splitbytes.bytes[x], 1, 10);//{5-1,5-2,5-3,5-4,6-1,6-2,6-3,6-4}, {3-1,3-2-,3-3,3-4,4-1,4-2-4-3}
//				HAL_UART_Transmit(&huart2, &miscl, 1, 10);
//				if(x==3)
//				{
//					HAL_UART_Transmit(&huart2, &txSE[1], 1, 10);
//				}
//      }
		//trigger();
		
  /* USER CODE END WHILE */

