manoj153/STM32F1BOARD/Src/main.c
		if((sensors >> 19) & 1)
		{
			HAL_GPIO_WritePin(CH2R_1_GPIO_Port, CH2R_1_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH2R_1_GPIO_Port, CH2R_1_Pin, GPIO_PIN_RESET);
		}
		//HAL_GPIO_WritePin(RLY1_GPIO_Port, RLY1_Pin, GPIO_PIN_SET);
	}
	if ((((sensors >> 20) ^ 1)&1) && (((sensors >> 21) ^1  )&1) && (((sensors >> 22) ^ 1)&1) && (((sensors >> 23) ^1) &1))
	{
		//Turn ON Green LED for CH1
		HAL_GPIO_WritePin(CH1G_1_GPIO_Port, CH1G_1_Pin, GPIO_PIN_SET);
		//Turn Of Any Red LEDS, System is good.
		HAL_GPIO_WritePin(CH1R_1_GPIO_Port, CH1R_1_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH1R_2_GPIO_Port, CH1R_2_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH1R_3_GPIO_Port, CH1R_3_Pin, GPIO_PIN_RESET);
		HAL_GPIO_WritePin(CH1R_4_GPIO_Port, CH1R_4_Pin, GPIO_PIN_RESET);
		CH1Rly = 0x00;
	}
	else
	{
		CH1Rly = 0x01;
		HAL_GPIO_WritePin(CH1G_1_GPIO_Port, CH1G_1_Pin, GPIO_PIN_RESET);
		//Each individual red led trigger CH1-1 -> CH1-1
		if((sensors >> 20) & 1)
		{
			HAL_GPIO_WritePin(CH1R_4_GPIO_Port, CH1R_4_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH1R_4_GPIO_Port, CH1R_4_Pin, GPIO_PIN_RESET);
		}
			
		if((sensors >> 21) & 1)
		{
			HAL_GPIO_WritePin(CH1R_3_GPIO_Port, CH1R_3_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH1R_3_GPIO_Port, CH1R_3_Pin, GPIO_PIN_RESET);
		}
		if((sensors >> 22) & 1)
		{
			HAL_GPIO_WritePin(CH1R_2_GPIO_Port, CH1R_2_Pin, GPIO_PIN_SET);
		}
		else
		{
			HAL_GPIO_WritePin(CH1R_2_GPIO_Port, CH1R_2_Pin, GPIO_PIN_RESET);
		}
			
		if((sensors >> 23) & 1)
		{
			HAL_GPIO_WritePin(CH1R_1_GPIO_Port, CH1R_1_Pin, GPIO_PIN_SET);
		}
		else 
		{
			HAL_GPIO_WritePin(CH1R_1_GPIO_Port, CH1R_1_Pin, GPIO_PIN_RESET);
		}
		//HAL_GPIO_WritePin(RLY1_GPIO_Port, RLY1_Pin, GPIO_PIN_SET);
	}
	
	//PowerSYS fail
	if ((miscl >> 7) & 1)
	{
		HAL_GPIO_WritePin(PWR_SYSF_GPIO_Port, PWR_SYSF_Pin, GPIO_PIN_SET);
		buzz(1);
	}
	else
	{
		HAL_GPIO_WritePin(PWR_SYSF_GPIO_Port, PWR_SYSF_Pin, GPIO_PIN_RESET);
	}
	if ((miscl >> 6) & 1)
	{
		HAL_GPIO_WritePin(ASYS_F_GPIO_Port, ASYS_F_Pin, GPIO_PIN_SET);
		buzz(1);
	}
	else
	{
		HAL_GPIO_WritePin(ASYS_F_GPIO_Port, ASYS_F_Pin, GPIO_PIN_RESET);
	}
	if((CH1Rly | CH2Rly | CH3Rly | CH4Rly | CH5Rly | CH6Rly))
	{
		HAL_GPIO_WritePin(RLY1_GPIO_Port, RLY1_Pin, GPIO_PIN_SET);
		buzz(1);
	}
	else
	{
		HAL_GPIO_WritePin(RLY1_GPIO_Port, RLY1_Pin, GPIO_PIN_RESET);
	}
}

void buzz(uint32_t rounds)
{
	if((buzzorNO&PERMENANTMUTE))
	{
	HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1 );
	for (uint16_t x = 0; x< rounds; x++)
	{
		HAL_Delay(1000);
	}
	HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1 );	
	}
}

void HAL_SYSTICK_Callback(void)
{
//	if(count1 >= 500 )
//	{
//	HAL_GPIO_TogglePin(PWR_LED_GPIO_Port, PWR_LED_Pin);	
//	count1 = 0;
//	}
//	else
//	{
//		count1++;
//	}
	Testpb = (HAL_GPIO_ReadPin(TESTpb_GPIO_Port,TESTpb_Pin));
	Mutepb = HAL_GPIO_ReadPin(MUTEpb_GPIO_Port, MUTEpb_Pin);
	Pmutepb = HAL_GPIO_ReadPin(PMUTEPB_GPIO_Port, PMUTEPB_Pin);
	//Testpb = ~(Testpb);
	if(Testpb != 1)
	{
		Test_1 ++;
		Test_0 = 0;
		if(Test_1 >= REFdebounce)
		{
			Test_1 = REFdebounce +1 ;
			TestpbState = 1;	
			
		}
	}
		else
		{
			Test_1 = 0; 
			Test_0++;
			if(Test_0 >= REFdebounce)
			{
			Test_0 = REFdebounce +1 ;
			TestpbState = 0;
			}
		}
		if(Mutepb != 1)
	{
		Mute_1 ++;
		Mute_0 = 0;
		if(Mute_1 >= REFdebounce)
		{
			Mute_1 = REFdebounce +1 ;
			MutepbState = 1;
			countetTIM1 = 0;
			
		}
	}
		else
		{
			Mute_1 = 0; 
			Mute_0++;
			if(Mute_0 >= REFdebounce)
			{
			Mute_0 = REFdebounce +1 ;
			MutepbState = 0;
			}
		}
		
		if(Pmutepb  != 1)
	{
		Pmute_1 ++;
		Pmute_0 = 0;
		if(Pmute_1 >= REFdebounce)
		{
			Pmute_1 = REFdebounce +1 ;
			PmutepbState = 1;
			PERMENANTMUTE = 0;
			
		}
	}
	}
	

void testRun(void)
{	
	onallLED();
	for(uint8_t x =0; x < 5; x++)
	{
		HAL_GPIO_TogglePin(CH1G_1_GPIO_Port, CH1G_1_Pin);
		HAL_GPIO_TogglePin(CH2G_2_GPIO_Port, CH2G_2_Pin);
		HAL_GPIO_TogglePin(CH3G_3_GPIO_Port, CH3G_3_Pin);
		HAL_GPIO_TogglePin(CH4G_4_GPIO_Port, CH4G_4_Pin);
		HAL_GPIO_TogglePin(CH5G_5_GPIO_Port, CH5G_5_Pin);
		HAL_GPIO_TogglePin(CH6G_6_GPIO_Port, CH6G_6_Pin);
		
		//#Toggle 1-6CH, Red LED  (4*6 = 24)
		//#CH1R-1 - CH1R-4
		HAL_GPIO_TogglePin(CH1R_1_GPIO_Port, CH1R_1_Pin);
		HAL_GPIO_TogglePin(CH1R_2_GPIO_Port, CH1R_2_Pin);
		HAL_GPIO_TogglePin(CH1R_3_GPIO_Port, CH1R_3_Pin);
		HAL_GPIO_TogglePin(CH1R_4_GPIO_Port, CH1R_4_Pin);
		
		//#CH2R-1 - CH2R-4
		HAL_GPIO_TogglePin(CH2R_1_GPIO_Port, CH2R_1_Pin);
		HAL_GPIO_TogglePin(CH2R_2_GPIO_Port, CH2R_2_Pin);
		HAL_GPIO_TogglePin(CH2R_3_GPIO_Port, CH2R_3_Pin);
		HAL_GPIO_TogglePin(CH2R_4_GPIO_Port, CH2R_4_Pin);
		//#CH3R-1 - CH3R-4
		HAL_GPIO_TogglePin(CH3R_1_GPIO_Port, CH3R_1_Pin);
		HAL_GPIO_TogglePin(CH3R_2_GPIO_Port, CH3R_2_Pin);
		HAL_GPIO_TogglePin(CH3R_3_GPIO_Port, CH3R_3_Pin);
		HAL_GPIO_TogglePin(CH3R_4_GPIO_Port, CH3R_4_Pin);
		//#CH4R-1 - CH4R-4
		HAL_GPIO_TogglePin(CH4R_1_GPIO_Port, CH4R_1_Pin);
		HAL_GPIO_TogglePin(CH4R_2_GPIO_Port, CH4R_2_Pin);
		HAL_GPIO_TogglePin(CH4R_3_GPIO_Port, CH4R_3_Pin);
		HAL_GPIO_TogglePin(CH4R_4_GPIO_Port, CH4R_4_Pin);
		
		//#CH5R-1 - CH5R-4
		HAL_GPIO_TogglePin(CH5R_1_GPIO_Port, CH5R_1_Pin);
		HAL_GPIO_TogglePin(CH5R_2_GPIO_Port, CH5R_2_Pin);
		HAL_GPIO_TogglePin(CH5R_3_GPIO_Port, CH5R_3_Pin);
		HAL_GPIO_TogglePin(CH5R_4_GPIO_Port, CH5R_4_Pin);
		
		//#CH6R-1 - CH6-4
		HAL_GPIO_TogglePin(CH6R_1_GPIO_Port, CH6R_1_Pin);
		HAL_GPIO_TogglePin(CH6R_2_GPIO_Port, CH6R_2_Pin);
		HAL_GPIO_TogglePin(CH6R_3_GPIO_Port, CH6R_3_Pin);
		HAL_GPIO_TogglePin(CH6R_4_GPIO_Port, CH6R_4_Pin);
		
		HAL_GPIO_TogglePin(ASYS_F_GPIO_Port, ASYS_F_Pin);
		HAL_GPIO_TogglePin(PWR_SYSF_GPIO_Port, PWR_SYSF_Pin);
		HAL_GPIO_TogglePin(PWR_LED_GPIO_Port, PWR_LED_Pin);
		HAL_GPIO_TogglePin(RLY1_GPIO_Port, RLY1_Pin);
		buzz(1);
		HAL_Delay(500);
		
	}
		//Always on the power end
		HAL_GPIO_WritePin(PWR_LED_GPIO_Port, PWR_LED_Pin, GPIO_PIN_SET);
	}

void onallLED(void)
{
		HAL_GPIO_WritePin(CH1G_1_GPIO_Port, CH1G_1_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH2G_2_GPIO_Port, CH2G_2_Pin, GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH3G_3_GPIO_Port, CH3G_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH4G_4_GPIO_Port, CH4G_4_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH5G_5_GPIO_Port, CH5G_5_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH6G_6_GPIO_Port, CH6G_6_Pin,GPIO_PIN_SET);
		
		//#Toggle 1-6CH, Red LED  (4*6 = 24)
		//#CH1R-1 - CH1R-4
		HAL_GPIO_WritePin(CH1R_1_GPIO_Port, CH1R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH1R_2_GPIO_Port, CH1R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH1R_3_GPIO_Port, CH1R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH1R_4_GPIO_Port, CH1R_4_Pin,GPIO_PIN_SET);
		
		//#CH2R-1 - CH2R-4
		HAL_GPIO_WritePin(CH2R_1_GPIO_Port, CH2R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH2R_2_GPIO_Port, CH2R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH2R_3_GPIO_Port, CH2R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH2R_4_GPIO_Port, CH2R_4_Pin,GPIO_PIN_SET);
		//#CH3R-1 - CH3R-4
		HAL_GPIO_WritePin(CH3R_1_GPIO_Port, CH3R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH3R_2_GPIO_Port, CH3R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH3R_3_GPIO_Port, CH3R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH3R_4_GPIO_Port, CH3R_4_Pin,GPIO_PIN_SET);
		//#CH4R-1 - CH4R-4
		HAL_GPIO_WritePin(CH4R_1_GPIO_Port, CH4R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH4R_2_GPIO_Port, CH4R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH4R_3_GPIO_Port, CH4R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH4R_4_GPIO_Port, CH4R_4_Pin,GPIO_PIN_SET);
		
		//#CH5R-1 - CH5R-4
		HAL_GPIO_WritePin(CH5R_1_GPIO_Port, CH5R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH5R_2_GPIO_Port, CH5R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH5R_3_GPIO_Port, CH5R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH5R_4_GPIO_Port, CH5R_4_Pin,GPIO_PIN_SET);
		
		//#CH6R-1 - CH6-4
		HAL_GPIO_WritePin(CH6R_1_GPIO_Port, CH6R_1_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH6R_2_GPIO_Port, CH6R_2_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH6R_3_GPIO_Port, CH6R_3_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(CH6R_4_GPIO_Port, CH6R_4_Pin,GPIO_PIN_SET);
		
		HAL_GPIO_WritePin(ASYS_F_GPIO_Port, ASYS_F_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(PWR_SYSF_GPIO_Port, PWR_SYSF_Pin,GPIO_PIN_SET);
		HAL_GPIO_WritePin(PWR_LED_GPIO_Port, PWR_LED_Pin,GPIO_PIN_SET);
}


void delayUS(uint32_t us)
{
	volatile uint32_t counter = 7*us;
	while(counter--);
}
 void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
 {
	 if(huart2.Instance == USART2 )
	 {
		 
	 }
 }
	
/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @param  None
  * @retval None
  */
void _Error_Handler(char * file, int line)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  while(1) 
  {
  }
  /* USER CODE END Error_Handler_Debug */ 
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */ 

/**
  * @}
*/ 

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
